zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
/***************************************************************************//**
* \file cy_crypto_core_aes_v2.c
* \version 2.150.1
*
* \brief
*  This file provides the source code fro the API for the AES method
*  in the Crypto driver.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

#include "cy_device.h"

#if defined(CY_IP_MXCRYPTO)

#include "cy_crypto_core_aes_v2.h"

#if defined(CY_CRYPTO_CFG_HW_V2_ENABLE)

#if defined(__cplusplus)
extern "C" {
#endif

#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C)

#include "cy_crypto_core_hw_v2.h"
#include "cy_crypto_core_mem_v2.h"
#include "cy_syslib.h"
#include <string.h>

CY_MISRA_DEVIATE_BLOCK_START('MISRA C-2012 Rule 11.3', 18, \
'Intentional Pointer Type Conversion')

#define CY_CRYPTO_IS_KEYLENGTH_VALID(keyLength) ((CY_CRYPTO_KEY_AES_128 == (keyLength)) || \
                                                 (CY_CRYPTO_KEY_AES_192 == (keyLength)) || \
                                                 (CY_CRYPTO_KEY_AES_256 == (keyLength)))



#if defined(CY_CRYPTO_CFG_CCM_C)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Init
****************************************************************************//*
*
* Performs an AES CCM Init operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesCcmBuffer The buffers should be a SAHB mapped addresses.
* The pointer to the memory buffers storage.
*
* \param aesState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Init(CRYPTO_Type *base,
                                            cy_stc_crypto_aes_ccm_buffers_t * aesCcmBuffer, cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesCcmBuffer) || (NULL == aesCcmState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    Cy_Crypto_Core_V2_MemSet(base, (void *)aesCcmBuffer, 0u, (uint16_t)sizeof(cy_stc_crypto_aes_ccm_buffers_t));
    Cy_Crypto_Core_V2_MemSet(base, (void *)aesCcmState, 0u, (uint16_t)sizeof(cy_stc_crypto_aes_ccm_state_t));

    aesCcmState->aesCbcMacState.buffers = &aesCcmBuffer->aesCbcMacBuffer;
    aesCcmState->aesCtrState.buffers = &aesCcmBuffer->aesCtrBuffer;
    aesCcmState->temp = aesCcmBuffer->temp_buffer;
    aesCcmState->ctr = aesCcmBuffer->ctr;
    aesCcmState->y = aesCcmBuffer->y;

    return CY_CRYPTO_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_SetKey
****************************************************************************//*
*
* Sets AES CCM Key for the operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param key
* The pointer to the CCM key.
*
* \param keyLength
* \ref cy_en_crypto_aes_key_length_t
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_SetKey(CRYPTO_Type *base,
                                            uint8_t const *key, cy_en_crypto_aes_key_length_t keyLength,
                                            cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == key) || (NULL == aesCcmState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }
    #if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        SCB_CleanDCache_by_Addr((volatile void *)key,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    #endif

    // Sets the AES Key for the CBC MAC operation
    status = Cy_Crypto_Core_V2_Aes_Init(base, key, keyLength, &aesCcmState->aesCbcMacState, aesCcmState->aesCbcMacState.buffers);
    if(CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    // Sets the AES Key for the CTR operation
    status = Cy_Crypto_Core_V2_Aes_Init(base, key, keyLength, &aesCcmState->aesCtrState, aesCcmState->aesCtrState.buffers);
    if(CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

    return CY_CRYPTO_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Initial_Block
****************************************************************************//*
*
*  Performs the Initial CCM calculation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Initial_Block(CRYPTO_Type *base,
                                            cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint32_t size_left = 0u;

    if(aesCcmState->isIvSet == false || aesCcmState->isLengthSet == false)
    {
        return CY_CRYPTO_SUCCESS;
    }

    status = Cy_Crypto_Core_V2_Aes_CbcMac_Setup(base, &aesCcmState->aesCbcMacState);
    if(CY_CRYPTO_SUCCESS != status)
    {
        return status;
    }

