zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
    return CY_CRYPTO_SUCCESS;
}



/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ccm_Free
****************************************************************************//*
*
* Clears AES CCM operation context.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesCcmState
* The pointer to the AES CCM state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ccm_Free(CRYPTO_Type *base, cy_stc_crypto_aes_ccm_state_t *aesCcmState)
{
    if((NULL != base) && (NULL != aesCcmState))
    {
       if(NULL != aesCcmState->aesCbcMacState.buffers)
       {
            Cy_Crypto_Core_V2_MemSet(base, (void *)aesCcmState->aesCbcMacState.buffers, 0u, (uint16_t)sizeof(cy_stc_crypto_aes_buffers_t));
       }
       if(NULL != aesCcmState->aesCtrState.buffers)
       {
           Cy_Crypto_Core_V2_MemSet(base, (void *)aesCcmState->aesCtrState.buffers, 0u, (uint16_t)sizeof(cy_stc_crypto_aes_buffers_t));
       }
       Cy_Crypto_Core_V2_MemSet(base, (void *)aesCcmState, 0u, (uint16_t)sizeof(cy_stc_crypto_aes_ccm_state_t));
    }

    return CY_CRYPTO_SUCCESS;
}

#endif /* CY_CRYPTO_CFG_CCM_C */

#if (CPUSS_CRYPTO_GCM == 1) && defined(CY_CRYPTO_CFG_GCM_C)

#define MIN(x, y) (((x) < (y)) ? (x) : (y))

/*******************************************************************************
* Function Name: Cy_Crypto_Aes_GCM_Increment_counter
****************************************************************************//**
*
* The function to increase the counter.
*
* \param counter_block
* The pointer to the counter to increase.
*******************************************************************************/

static void Cy_Crypto_Aes_GCM_Increment_counter(uint8_t * counter_block)
{
    uint32_t i;

    for (i=0U; i < 4U; i++)
    {
        if (++(counter_block[15U - i]) != 0U)
        {
            break;
        }
    }

}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Ghash
****************************************************************************//**
*
* The function to perform the GHASH multiplication operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param h
* The pointer to the Hash Subkey.
*
* \param input
* The pointer to the input data for ghash.
*
* \param length
* The length of the input data.
*
* \param y
* The pointer holding the current hash value and it gets updated after the ghash multiplication.

*******************************************************************************/
static void Cy_Crypto_Core_V2_Aes_GCM_Ghash(CRYPTO_Type *base, uint8_t *h,  const uint8_t *input, uint32_t length, uint8_t *y)

{
    uint32_t load_length;
    static const uint8_t p_padding[] = {
    0x00,0x00,0x00,0x00,0x00,0x00,0x00,0x00,
    0x00,0x00,0x00,0x00,0x00,0x00,0x00};

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_CleanDCache_by_Addr((volatile void*)h,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    SCB_CleanDCache_by_Addr((volatile void*)input,(int32_t)length);
    SCB_CleanDCache_by_Addr((volatile void*)y,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif
    // Load the Hash Sub Key H
    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, h, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_BlockMov_Reflect(base, CY_CRYPTO_V2_RB_BLOCK3, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, y, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_BlockMov_Reflect(base, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_Sync(base);

    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, input, length);

    while (length != 0U)
    {
        load_length = MIN (length, CY_CRYPTO_AES_BLOCK_SIZE);

        // Padding for the last block if the length is not AES Block size
        if (load_length < CY_CRYPTO_AES_BLOCK_SIZE)
        {
             Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, (const uint8_t*)CY_REMAP_ADDRESS_FOR_CRYPTO(p_padding) , CY_CRYPTO_AES_BLOCK_SIZE-load_length);
        }

        input  += load_length;
        length   -= load_length;

        Cy_Crypto_Core_V2_BlockMov_Reflect(base, CY_CRYPTO_V2_RB_BLOCK2, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_BLOCK2, CY_CRYPTO_AES_BLOCK_SIZE);

        // Perform the AES GHASH operation
        Cy_Crypto_Core_V2_BlockGcm(base);
   }

    // Store the calculated output value to Y
    Cy_Crypto_Core_V2_BlockMov_Reflect(base, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_FFStart(base, CY_CRYPTO_V2_RB_FF_STORE, y, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_RBStore(base, CY_CRYPTO_AES_BLOCK_SIZE, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_FFStoreSync(base);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_CleanDCache_by_Addr((volatile void*)h,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    SCB_CleanDCache_by_Addr((volatile void*)input,(int32_t)length);
    SCB_CleanDCache_by_Addr((volatile void*)y,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Init
****************************************************************************//**
*
* The function to initialize AES GCM operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesGCMBuffers
* The pointer to the AES GCM memory buffers storage.
*
* \param aesGCMctx
* The pointer to the AES GCM structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

