zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
        }

        else
        {
            ivBitlen[0] = (uint64_t)ivSize << 3U;
            ivBitlen[0] = CY_SWAP_ENDIAN64(ivBitlen[0]);

            Cy_Crypto_Core_V2_MemSet(base, CY_REMAP_ADDRESS_FOR_CRYPTO(temp), 0u, CY_CRYPTO_AES_BLOCK_SIZE);
            Cy_Crypto_Core_V2_MemCpy(base, CY_REMAP_ADDRESS_FOR_CRYPTO(&temp[8U]), (void*)ivBitlen, 8U);

            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, ivRemap, ivSize, icbRemap);
            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, CY_REMAP_ADDRESS_FOR_CRYPTO(temp), CY_CRYPTO_AES_BLOCK_SIZE, icbRemap);
        }

        Cy_Crypto_Core_V2_MemCpy(base, (void*)cbRemap,  (void*)icbRemap, CY_CRYPTO_AES_BLOCK_SIZE);

        Cy_Crypto_Aes_GCM_Increment_counter(aesGCMctx->cb);
        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return tmpResult;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_AAD_Update
****************************************************************************//**
*
* The function to update the Additional Authentication Data.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aad
* The pointer to the Additional Authentication Data.
*
* \param aadSize
*  The length of the additional Authentication Data
*
* \param aesGCMctx
* The pointer to the AES aesGCMctx structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_AAD_Update(CRYPTO_Type *base,  uint8_t *aad,   uint32_t aadSize, cy_stc_crypto_aes_gcm_state_t* aesGCMctx)

{
    uint32_t rem_add_size;
    uint32_t copy_size;
    uint32_t block_count;
    uint8_t* aadRemap ;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t *hRemap;
    uint8_t *yRemap;
    uint8_t *tempRemap;

    if(0u == aadSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    if((NULL != base) && (NULL != aad) && (NULL != aesGCMctx))
    {

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)aad,(int32_t)aadSize);
#endif
        aadRemap =  (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aad);

        hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
        yRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->y);
        tempRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->temp);

        rem_add_size = aesGCMctx->aad_size % CY_CRYPTO_AES_BLOCK_SIZE;

        if(rem_add_size + aadSize < CY_CRYPTO_AES_BLOCK_SIZE)
        {
            Cy_Crypto_Core_V2_MemCpy(base, (void*)&tempRemap[rem_add_size], (void*)aadRemap, (uint16_t)aadSize);
            aesGCMctx->aad_size += aadSize;
        }

        else
        {
            copy_size = CY_CRYPTO_AES_BLOCK_SIZE - rem_add_size;
            Cy_Crypto_Core_V2_MemCpy(base, (void*)&tempRemap[rem_add_size], (void*)aadRemap, (uint16_t)copy_size);
            aesGCMctx->aad_size += copy_size;
            aadSize -=  copy_size;
            aadRemap += copy_size;

            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, tempRemap, CY_CRYPTO_AES_BLOCK_SIZE, yRemap);
            block_count = aadSize/CY_CRYPTO_AES_BLOCK_SIZE;
            Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, aadRemap, block_count * CY_CRYPTO_AES_BLOCK_SIZE, yRemap);
            aadRemap += block_count *CY_CRYPTO_AES_BLOCK_SIZE;
            Cy_Crypto_Core_V2_MemCpy(base, (void*)tempRemap, (void*)aadRemap, (uint16_t)(aadSize % CY_CRYPTO_AES_BLOCK_SIZE));
            aesGCMctx->aad_size +=  block_count *CY_CRYPTO_AES_BLOCK_SIZE + aadSize % CY_CRYPTO_AES_BLOCK_SIZE;
        }

        tmpResult = CY_CRYPTO_SUCCESS;
    }

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_GCM_Update
****************************************************************************//**
*
* The function to update the data
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param input
* The pointer to the input data to be encrypted/decrypted.
*
* \param inputSize
*  The length of the input data.
*
* \param output
* The pointer to the encrypted/decrypted output data.
*
* \param aesGCMctx
* The pointer to the AES aesGCMctx structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_GCM_Update(CRYPTO_Type *base, uint8_t const *input,   uint32_t inputSize,  uint8_t *output,
                                                         cy_stc_crypto_aes_gcm_state_t* aesGCMctx)
{

    uint32_t process_size;
    uint32_t index=0, i=0;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;
    uint8_t temp[CY_CRYPTO_AES_BLOCK_SIZE];
    uint8_t *hRemap;
    uint8_t *yRemap;
    uint8_t *tempRemap;
    uint8_t *aesdataRemap;
    uint8_t *cbRemap;

    if(0u ==inputSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

    if((NULL != base) && (NULL != input)  && (NULL != output) &&  (NULL != aesGCMctx))
    {

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)input,(int32_t)inputSize);
#endif

        hRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->h);
        yRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->y);
        tempRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->temp);
        aesdataRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->aes_data);
        cbRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(aesGCMctx->cb);

        if(aesGCMctx->aad_size %CY_CRYPTO_AES_BLOCK_SIZE != 0u)
        {
            if(aesGCMctx->partial_aad_processed == false)
            {
                Cy_Crypto_Core_V2_Aes_GCM_Ghash(base, hRemap, tempRemap, aesGCMctx->aad_size%CY_CRYPTO_AES_BLOCK_SIZE , yRemap);
                aesGCMctx->partial_aad_processed = true;
            }
        }

        while(inputSize != 0u)
        {
            if(aesGCMctx->data_size % CY_CRYPTO_AES_BLOCK_SIZE == 0u)
            {
                (void)Cy_Crypto_Core_V2_Aes_Ecb(base, CY_CRYPTO_ENCRYPT,  aesdataRemap, cbRemap, &aesGCMctx->aesState);
                Cy_Crypto_Aes_GCM_Increment_counter(aesGCMctx->cb);
            }
            if(aesGCMctx->data_size %CY_CRYPTO_AES_BLOCK_SIZE + inputSize < CY_CRYPTO_AES_BLOCK_SIZE)
            {
                process_size =  aesGCMctx->data_size %CY_CRYPTO_AES_BLOCK_SIZE + inputSize;
            }

            else
            {
                process_size =  CY_CRYPTO_AES_BLOCK_SIZE;
            }

            for (i=aesGCMctx->data_size %CY_CRYPTO_AES_BLOCK_SIZE; i< process_size  ; i++)
            {
                temp[i] = aesGCMctx->aes_data[i] ^ input[index];

