zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
    aesState->dirMode = dirMode;
    aesState->unProcessedBytes = 0u;

    return CY_CRYPTO_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cbc_Set_IV
****************************************************************************//**
*
* Function to set AES CBC IV.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param iv
* The pointer to the IV.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/

cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cbc_Set_IV(CRYPTO_Type *base,
                                            uint8_t const * iv,
                                            cy_stc_crypto_aes_state_t *aesState)
{
    uint8_t *ivRemap;

    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == iv))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)iv,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    ivRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(iv);

    Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->iv, (void*)ivRemap, (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE);

    return CY_CRYPTO_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cbc_Update
****************************************************************************//**
*
* Performs an AES CBC Multistage update operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of the source block.
*
* \param dst
* The pointer to a destination cipher block.
*
* \param src
* The pointer to a source block.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cbc_Update(CRYPTO_Type *base,
                                            uint32_t srcSize,
                                            uint8_t *dst,
                                            uint8_t const *src,
                                            cy_stc_crypto_aes_state_t *aesState)


{

    cy_en_crypto_status_t status = CY_CRYPTO_BAD_PARAMS;
    uint32_t bytes_to_copy=0u;
    uint32_t cnt=0u;
    uint8_t *dstRemap;
    uint8_t *srcRemap;

    if(0u == srcSize)
    {
        return CY_CRYPTO_SUCCESS;
    }

        /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState) || (NULL == src))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    if(((aesState->unProcessedBytes + srcSize) >= CY_CRYPTO_AES_BLOCK_SIZE) && (NULL == dst))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)src,(int32_t)srcSize);
#endif


    dstRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(dst);
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(src);

    if(aesState->unProcessedBytes + srcSize < CY_CRYPTO_AES_BLOCK_SIZE)
    {

        Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)srcSize);
        aesState->unProcessedBytes += srcSize;
        status = CY_CRYPTO_SUCCESS;
    }
    else
    {

        if(aesState->unProcessedBytes > 0u)
        {

            bytes_to_copy = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;

            if (srcSize < bytes_to_copy)
            {
                bytes_to_copy = srcSize;
            }

            Cy_Crypto_Core_V2_MemCpy(base, (void*)&aesState->buffers->unProcessedData[aesState->unProcessedBytes], (void*)srcRemap, (uint16_t)bytes_to_copy);

            status = Cy_Crypto_Core_V2_Aes_Cbc(base, aesState->dirMode, CY_CRYPTO_AES_BLOCK_SIZE, aesState->buffers->iv, dstRemap, aesState->buffers->unProcessedData, aesState);
            if(CY_CRYPTO_SUCCESS != status)
            {
                return status;
            }

            srcSize -= bytes_to_copy;
            srcRemap += bytes_to_copy;
            dstRemap += CY_CRYPTO_AES_BLOCK_SIZE;
            aesState->unProcessedBytes = 0u;
        }

        cnt = (uint32_t)(srcSize / CY_CRYPTO_AES_BLOCK_SIZE);

        if(cnt != 0u)
        {
            status = Cy_Crypto_Core_V2_Aes_Cbc(base, aesState->dirMode, cnt * CY_CRYPTO_AES_BLOCK_SIZE, aesState->buffers->iv, dstRemap, srcRemap, aesState);

            if(CY_CRYPTO_SUCCESS != status)
            {
                return status;
            }

            dstRemap +=  cnt * CY_CRYPTO_AES_BLOCK_SIZE;
            srcRemap += cnt * CY_CRYPTO_AES_BLOCK_SIZE;
            srcSize -= cnt * CY_CRYPTO_AES_BLOCK_SIZE;
        }

        if(srcSize > 0u)
        {
            Cy_Crypto_Core_V2_MemCpy(base, aesState->buffers->unProcessedData, (void*)srcRemap, (uint16_t)srcSize);
            aesState->unProcessedBytes = srcSize;
        }
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(dst, (int32_t)srcSize);
#endif

    return status;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cbc_Finish
****************************************************************************//**
*
* Performs an AES CBC finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cbc_Finish(CRYPTO_Type *base, cy_stc_crypto_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

