zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
        Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);
        Cy_Crypto_Core_V2_RunAes(base);

        Cy_Crypto_Core_V2_FFStart (base, CY_CRYPTO_V2_RB_FF_STORE, unprocessedRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, srcSize);
        Cy_Crypto_Core_V2_FFStart   (base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, srcSize);

        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, srcSize);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, srcSize);

        if(aesState->dirMode == CY_CRYPTO_ENCRYPT)
        {
            Cy_Crypto_Core_V2_MemCpy(base, &aesState->buffers->iv, dstRemap, (uint16_t)srcSize);
        }
        else
        {
            Cy_Crypto_Core_V2_MemCpy(base, &aesState->buffers->iv, srcRemap, (uint16_t)srcSize);
        }

        aesState->unProcessedBytes += srcSize;
        srcSize -= bytes_rem;

        tmpResult = CY_CRYPTO_SUCCESS;
    }

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(dst, (int32_t)srcSize);
#endif

    return tmpResult;
}


/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Cfb_Finish
****************************************************************************//**
*
* Performs an AES CFB finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Cfb_Finish(CRYPTO_Type *base, cy_stc_crypto_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    return CY_CRYPTO_SUCCESS;
}

#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ctr
********************************************************************************
*
* Performs AES operation on a plain text using the counter method (CTR).
*
* For CAT1C & CAT1D(CM55) devices when D-Cache is enabled parameters ivPtr, streamBlock, dst and src must align and end in 32 byte boundary.
* For CAT1A and CAT1C devices with DCache disabled, src must be 4-Byte aligned.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param srcSize
* The size of a source plain text.
*
* \param srcOffset
* The size of an offset within the current block stream for resuming within the
* current cipher stream.
*
* \param ivPtr
* The 128-bit initial vector that contains a 64-bit nonce and 64-bit counter.
*
* \param streamBlock
* The saved stream-block for resuming. Is over-written by the function.
*
* \param dst
* The pointer to a destination cipher text.
*
* \param src
* The pointer to a source plain text.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
#define CY_CRYPTO_AES_CTR_CNT_POS           (2U)
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ctr(CRYPTO_Type *base,
                                            uint32_t srcSize,
                                            uint32_t *srcOffset,
                                            uint8_t *ivPtr,
                                            uint8_t *streamBlock,
                                            uint8_t *dst,
                                            uint8_t const *src,
                                            cy_stc_crypto_aes_state_t *aesState)
{
    uint32_t blockCount_t[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_BLOCK_SIZE_U32)+CY_CRYPTO_DCAHCE_PADDING_SIZE_WORD];
    uint32_t *blockCount = (uint32_t *)CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(blockCount_t);
    uint16_t blockCount_size = (uint16_t)CY_CRYPTO_AES_BLOCK_SIZE;
    uint32_t *blockCounter = (uint32_t *) CY_REMAP_ADDRESS_FOR_CRYPTO(blockCount);

    uint64_t counter;
    uint32_t cnt;
    uint32_t i;
    uint8_t *dstRemap;
    uint8_t *srcRemap;
    uint8_t *ivRemap;

    (void)streamBlock; /* Suppress warning */

    Cy_Crypto_Core_V2_MemSet(base, (void*)blockCounter, 0x00U, blockCount_size);

    dstRemap =(uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(dst);
    srcRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(src);
    ivRemap =(uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(ivPtr);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)ivPtr,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
    SCB_CleanDCache_by_Addr((volatile void *)src,(int32_t)srcSize);
    SCB_CleanDCache_by_Addr((volatile void *)streamBlock,(int32_t)CY_CRYPTO_AES_BLOCK_SIZE);
#endif

    blockCount[ 0] = (uint32_t) CY_CRYPTO_MERGE_BYTES(ivPtr[ 3], ivPtr[ 2], ivPtr[ 1], ivPtr[ 0]);
    blockCount[ 1] = (uint32_t) CY_CRYPTO_MERGE_BYTES(ivPtr[ 7], ivPtr[ 6], ivPtr[ 5], ivPtr[ 4]);
    blockCount[ 2] = (uint32_t) CY_CRYPTO_MERGE_BYTES(ivPtr[11], ivPtr[10], ivPtr[ 9], ivPtr[ 8]);
    blockCount[ 3] = (uint32_t) CY_CRYPTO_MERGE_BYTES(ivPtr[15], ivPtr[14], ivPtr[13], ivPtr[12]);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)blockCount,(int32_t)blockCount_size);
#endif

    counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCount + CY_CRYPTO_AES_CTR_CNT_POS));

