zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
    Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);

    Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, (const uint8_t *) blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);
    Cy_Crypto_Core_V2_BlockMov  (base, CY_CRYPTO_V2_RB_BLOCK0,   CY_CRYPTO_V2_RB_FF_LOAD1, CY_CRYPTO_AES_BLOCK_SIZE);

    /* CTR counter is placed into last 4 bytes of the Nonce block */
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 4U, (uint8_t)((counter >> 24U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 3U, (uint8_t)((counter >> 16U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 2U, (uint8_t)((counter >>  8U) & 0xffU));
    Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 1U, (uint8_t)((counter) & 0xffU));

    if(aesState->unProcessedBytes == 0u)
    {
        Cy_Crypto_Core_V2_RunAes(base);
        Cy_Crypto_Core_V2_FFStart   (base, CY_CRYPTO_V2_RB_FF_STORE, unprocessedRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);
    }
    else
    {
        bytes_rem = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;
        if (srcSize < bytes_rem)
        {
            bytes_rem = srcSize;
        }
        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, &unprocessedRemap[aesState->unProcessedBytes], bytes_rem);
        Cy_Crypto_Core_V2_BlockMov  (base, CY_CRYPTO_V2_RB_BLOCK1,   CY_CRYPTO_V2_RB_FF_LOAD1, bytes_rem);

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, bytes_rem);
        Cy_Crypto_Core_V2_FFStart   (base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, bytes_rem);

        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, bytes_rem);

        srcSize -= bytes_rem;
        aesState->unProcessedBytes += bytes_rem;
        srcRemap += bytes_rem;
        dstRemap += bytes_rem;


    }

    if(aesState->unProcessedBytes == CY_CRYPTO_AES_BLOCK_SIZE)
    {
        aesState->unProcessedBytes = 0;

        /* Increment the nonce counter */
        counter++;
        *(uint64_t*)(blockCount + CY_CRYPTO_AES_CTR_CNT_POS) = CY_SWAP_ENDIAN64(counter);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)blockCount,(int32_t)blockCount_size);
#endif
        /* CTR counter is placed into last 4 bytes of the Nonce block */
        Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 4U, (uint8_t)((counter >> 24u) & 0xffU));
        Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 3U, (uint8_t)((counter >> 16u) & 0xffU));
        Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 2U, (uint8_t)((counter >>  8u) & 0xffU));
        Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 1U, (uint8_t)((counter) & 0xffU));

        Cy_Crypto_Core_V2_MemCpy(base, aesState->buffers->iv, blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);

    }

    cnt = (uint32_t)(srcSize / CY_CRYPTO_AES_BLOCK_SIZE);
    if(cnt > 0u)
    {
        status = Cy_Crypto_Core_V2_Aes_Ctr(CRYPTO,cnt*CY_CRYPTO_AES_BLOCK_SIZE, &srcOffset, aesState->buffers->iv, NULL, dstRemap, srcRemap, aesState);

        if(CY_CRYPTO_SUCCESS != status)
        {
            return status;
        }
        srcSize -= cnt*CY_CRYPTO_AES_BLOCK_SIZE;
        srcRemap += cnt*CY_CRYPTO_AES_BLOCK_SIZE;
        dstRemap += cnt*CY_CRYPTO_AES_BLOCK_SIZE;

        blockCount[ 0] = (uint32_t) CY_CRYPTO_MERGE_BYTES( aesState->buffers->iv[3], aesState->buffers->iv[ 2], aesState->buffers->iv[ 1], aesState->buffers->iv[ 0]);
        blockCount[ 1] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[ 7], aesState->buffers->iv[ 6], aesState->buffers->iv[ 5], aesState->buffers->iv[ 4]);
        blockCount[ 2] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[11], aesState->buffers->iv[10], aesState->buffers->iv[ 9], aesState->buffers->iv[ 8]);
        blockCount[ 3] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[15], aesState->buffers->iv[14], aesState->buffers->iv[13], aesState->buffers->iv[12]);
    }

    if(srcSize>0u)
    {

        if(aesState->unProcessedBytes == 0u)
        {
            blockCount[ 0] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[3], aesState->buffers->iv[ 2], aesState->buffers->iv[ 1], aesState->buffers->iv[ 0]);
            blockCount[ 1] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[ 7], aesState->buffers->iv[ 6], aesState->buffers->iv[ 5], aesState->buffers->iv[ 4]);
            blockCount[ 2] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[11], aesState->buffers->iv[10], aesState->buffers->iv[ 9], aesState->buffers->iv[ 8]);
            blockCount[ 3] = (uint32_t) CY_CRYPTO_MERGE_BYTES(aesState->buffers->iv[15], aesState->buffers->iv[14], aesState->buffers->iv[13], aesState->buffers->iv[12]);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    /* Flush the cache */
    SCB_CleanDCache_by_Addr((volatile void *)blockCount,(int32_t)blockCount_size);
#endif

            counter = CY_SWAP_ENDIAN64(*(uint64_t*)(blockCount + CY_CRYPTO_AES_CTR_CNT_POS));

            Cy_Crypto_Core_V2_Aes_LoadEncKey(base, aesState);

            Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD1, (const uint8_t *) blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);
            Cy_Crypto_Core_V2_BlockMov  (base, CY_CRYPTO_V2_RB_BLOCK0,   CY_CRYPTO_V2_RB_FF_LOAD1, CY_CRYPTO_AES_BLOCK_SIZE);

            /* CTR counter is placed into last 4 bytes of the Nonce block */
            Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 4U, (uint8_t)((counter >> 24U) & 0xffU));
            Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 3U, (uint8_t)((counter >> 16U) & 0xffU));
            Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 2U, (uint8_t)((counter >>  8U) & 0xffU));
            Cy_Crypto_Core_V2_RBSetByte(base, CY_CRYPTO_AES_BLOCK_SIZE - 1U, (uint8_t)((counter) & 0xffU));

            Cy_Crypto_Core_V2_RunAes(base);

