zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/source/cy_crypto_core_aes_v2.c
        }

        Cy_Crypto_Core_V2_FFStart   (base, CY_CRYPTO_V2_RB_FF_STORE, unprocessedRemap, CY_CRYPTO_AES_BLOCK_SIZE);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK1, CY_CRYPTO_AES_BLOCK_SIZE);

        bytes_rem = CY_CRYPTO_AES_BLOCK_SIZE - aesState->unProcessedBytes;

        if (srcSize < bytes_rem)
        {
            bytes_rem = srcSize;
        }

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, &unprocessedRemap[aesState->unProcessedBytes], bytes_rem);
        Cy_Crypto_Core_V2_BlockMov  (base, CY_CRYPTO_V2_RB_BLOCK1,   CY_CRYPTO_V2_RB_FF_LOAD0, bytes_rem);

        Cy_Crypto_Core_V2_FFContinue(base, CY_CRYPTO_V2_RB_FF_LOAD0, srcRemap, bytes_rem);
        Cy_Crypto_Core_V2_FFStart   (base, CY_CRYPTO_V2_RB_FF_STORE, dstRemap, bytes_rem);

        Cy_Crypto_Core_V2_BlockXor(base, CY_CRYPTO_V2_RB_BLOCK0, CY_CRYPTO_V2_RB_FF_LOAD0, CY_CRYPTO_V2_RB_BLOCK1, bytes_rem);
        Cy_Crypto_Core_V2_BlockMov(base, CY_CRYPTO_V2_RB_FF_STORE, CY_CRYPTO_V2_RB_BLOCK0, bytes_rem);

        aesState->unProcessedBytes += bytes_rem;
    }

    Cy_Crypto_Core_V2_MemCpy(base, aesState->buffers->iv, blockCounter, CY_CRYPTO_AES_BLOCK_SIZE);


#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
    SCB_InvalidateDCache_by_Addr(dst, (int32_t)srcSize);
#endif

    return CY_CRYPTO_SUCCESS;
}




/*******************************************************************************
* Function Name: Cy_Crypto_Core_V2_Aes_Ctr_Finish
****************************************************************************//**
*
* Performs an AES CTR Finish operation.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param aesState
* The pointer to the AES state structure allocated by the user. The user
* must not modify anything in this structure.
*
* \return
* \ref cy_en_crypto_status_t
*
*******************************************************************************/
cy_en_crypto_status_t Cy_Crypto_Core_V2_Aes_Ctr_Finish(CRYPTO_Type *base, cy_stc_crypto_aes_state_t *aesState)
{
    /* Input parameters verification */
    if ((NULL == base) || (NULL == aesState))
    {
        return CY_CRYPTO_BAD_PARAMS;
    }

    return CY_CRYPTO_SUCCESS;
}

#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
CY_MISRA_BLOCK_END('MISRA C-2012 Rule 11.3')
#endif /* (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C) */

#if defined(__cplusplus)
}
#endif

#endif /* defined(CY_CRYPTO_CFG_HW_V2_ENABLE) */

#endif /* defined(CY_IP_MXCRYPTO) */


/* [] END OF FILE */
